wisp-tests/last-history/data/attachments/e7627c032c5b801a.txt

URL: https://api.uat.platform.pagopa.it/nodo/node-for-psp/v1
Request:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
	<soapenv:Header />
	<soapenv:Body>
		<nod:activatePaymentNoticeV2Request>
			<idPSP>AGID_01</idPSP>
			<idBrokerPSP>97735020584</idBrokerPSP>
			<idChannel>97735020584_03</idChannel>
			<password>***</password>
			<idempotencyKey>351175351410757088_3734289486</idempotencyKey>
			<qrCode>
				<fiscalCode>15376371009</fiscalCode>
				<noticeNumber>351175351410757088</noticeNumber>
			</qrCode>
			<expirationTime>900000</expirationTime>
			<amount>248.25</amount>
			<paymentNote>26f781f4-bef7-4a26-92e3-93d436ab6ce5</paymentNote>
		</nod:activatePaymentNoticeV2Request>
	</soapenv:Body>
</soapenv:Envelope>
